content/posts/Whatever_next_Predictive_brains,_situated_agents,_and_the_future_of_cognitive_science_by_Andy_Clark_in_2013.md
+++
title = "Whatever next? Predictive brains, situated agents, and the future of cognitive science by Andy Clark in 2013"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:26-04:00
slug = "Whatever_next_Predictive_brains,_situated_agents,_and_the_future_of_cognitive_science_by_Andy_Clark_in_2013"
draft = false
+++

## [Andy Clark]({{< relref "Andy_Clark" >}}) {#andy-clark--andy-clark-dot-md}


## Brains, it has recently been argued, are essentially prediction machines. They are bundles of cells that support perception and action by constantly attempting to match incoming sensory inputs with top-down expectations or predictions. This is achieved using a hierarchical generative model that aims to minimize prediction error within a bidirectional cascade of cortical processing. {#brains-it-has-recently-been-argued-are-essentially-prediction-machines-dot-they-are-bundles-of-cells-that-support-perception-and-action-by-constantly-attempting-to-match-incoming-sensory-inputs-with-top-down-expectations-or-predictions-dot-this-is-achieved-using-a-hierarchical-generative-model-that-aims-to-minimize-prediction-error-within-a-bidirectional-cascade-of-cortical-processing-dot}


## “The whole function of the brain is summed up in: error correction.” So wrote [W. Ross Ashby]({{< relref "W_Ross_Ashby" >}}), the British psychiatrist and cyberneticist, some half a century ago. {#the-whole-function-of-the-brain-is-summed-up-in-error-correction-dot-so-wrote-w-dot-ross-ashby--w-ross-ashby-dot-md--the-british-psychiatrist-and-cyberneticist-some-half-a-century-ago-dot}


## Helmholz’s insight informed influential work by MacKay (1956), Neisser (1967), and Gregory (1980), as part of the cognitive psychological tradition that became known as “analysis-by-synthesis” (for a review, see Yuille & Kersten 2006) {#helmholz-s-insight-informed-influential-work-by-mackay--1956--neisser--1967--and-gregory--1980--as-part-of-the-cognitive-psychological-tradition-that-became-known-as-analysis-by-synthesis--for-a-review-see-yuille-and-kersten-2006}


### MacKay,D.M.(1956) The epistemological problem for automata. In: Automata studies, ed. C. E. Shannon&J.McCarthy, pp. 235–51. PrincetonUniversityPress {#mackay-d-dot-m-dot--1956--the-epistemological-problem-for-automata-dot-in-automata-studies-ed-dot-c-dot-e-dot-shannon-and-j-dot-mccarthy-pp-dot-235-51-dot-princetonuniversitypress}


### Neisser, U. (1967) Cognitive psychology. Appleton-Century-Crofts {#neisser-u-dot--1967--cognitive-psychology-dot-appleton-century-crofts}


### Gregory, R. L. (1980) Perceptions as hypotheses. Philosophical Transactions of the Royal Society of London B 290(1038):181–97 {#gregory-r-dot-l-dot--1980--perceptions-as-hypotheses-dot-philosophical-transactions-of-the-royal-society-of-london-b-290--1038--181-97}


### Yuille, A. & Kersten, D. (2006) Vision as Bayesian inference: Analysis by synthesis? Trends in Cognitive Science 10(7):301–308. {#yuille-a-dot-and-kersten-d-dot--2006--vision-as-bayesian-inference-analysis-by-synthesis-trends-in-cognitive-science-10--7--301-308-dot}


## Maximal mutual information, not minimal entropy, for escaping the “Dark Room” {#maximal-mutual-information-not-minimal-entropy-for-escaping-the-dark-room}


### Important early implementations of a [maximal mutual information principle]({{< relref "maximal_mutual_information_principle" >}}) in modeling passive learning include the [computational mechanics]({{< relref "computational_mechanics" >}}) approach for dynamical systems of Crutchfield and Young (1989) and the [information bottleneck method]({{< relref "information_bottleneck_method" >}}) of [Naftali Tishby]({{< relref "Naftali_Tishby" >}}) et al. (1999) for analyzing time series. Recently, the [information bottleneck method]({{< relref "information_bottleneck_method" >}}) has been extended to action selection by Still (2009). Further, the [predictive information maximization]({{< relref "predictive_information_maximization" >}}) of Ay et al. (2008) has shown that complex behaviors can emerge from simple manipulations of action controllers towards maximizing the [mutual information]({{< relref "mutual_information" >}}) between states. And our own work utilizes [mutual information]({{< relref "mutual_information" >}}) to drive exploratory behaviors (Little & Sommer 2011). {#important-early-implementations-of-a-maximal-mutual-information-principle--maximal-mutual-information-principle-dot-md--in-modeling-passive-learning-include-the-computational-mechanics--computational-mechanics-dot-md--approach-for-dynamical-systems-of-crutchfield-and-young--1989--and-the-information-bottleneck-method--information-bottleneck-method-dot-md--of-naftali-tishby--naftali-tishby-dot-md--et-al-dot--1999--for-analyzing-time-series-dot-recently-the-information-bottleneck-method--information-bottleneck-method-dot-md--has-been-extended-to-action-selection-by-still--2009--dot-further-the-predictive-information-maximization--predictive-information-maximization-dot-md--of-ay-et-al-dot--2008--has-shown-that-complex-behaviors-can-emerge-from-simple-manipulations-of-action-controllers-towards-maximizing-the-mutual-information--mutual-information-dot-md--between-states-dot-and-our-own-work-utilizes-mutual-information--mutual-information-dot-md--to-drive-exploratory-behaviors--little-and-sommer-2011--dot}
